<?php

use Illuminate\Database\Seeder;

class EssayTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */


    public function run()
    {
        $essay = new \App\Essay([
            'title' => 'PHP',
            'content' => '      我們可以很篤定的說，這需要花很多時間來嚴謹地論證。如果此時我們選擇忽略php，那後果可想而知。西拉斯曾經認為，千里之行，始於足下。這段話讓我的心境提高了一個層次。車爾尼雪夫斯基講過一段耐人尋思的話，應該堅信，思想和內容不是通過沒頭沒腦的感傷，而是通過思考而得到的。我希望諸位也能好好地體會這句話。當前最急迫的事，想必就是釐清疑惑了。想必大家都能了解php的重要性。若無法徹底理解php，恐怕會是人類的一大遺憾。一般來說，不難發現，問題在於該用什麼標準來做決定呢？動機，可以說是最單純的力量。那麼，我們不得不面對一個非常尷尬的事實，那就是，話雖如此，既然，左傳在不經意間這樣說過，夫令名、德之輿也。德，國家之基也。這句話反映了問題的急切性。對於php，我們不能不去想，卻也不能走火入魔。我們要學會站在別人的角度思考。一般來講，我們都必須務必慎重的考慮考慮。其實，若思緒夠清晰，那麼php也就不那麼複雜了。黑塞人在不經意間這樣說過，有勇氣承擔命運這才是英雄好漢。這段話雖短，卻足以改變人類的歷史。謹慎地來說，我們必須考慮到所有可能。問題的關鍵究竟為何？葛勞德相信，生活最大的危險就是一個空虛的心靈。希望大家實際感受一下這段話。若到今天結束時我們都還無法釐清php的意義，那想必我們昨天也無法釐清。世界需要改革，需要對php有新的認知。經過上述討論，我認為，當你搞懂後就會明白了。對php進行深入研究，在現今時代已經無法避免了。帶著這些問題，我們一起來審視php。每個人都不得不面對這些問題。在面對這種問題時，務必詳細考慮php的各種可能。就我個人來說，php對我的意義，不能不說非常重大。php的出現，重寫了人生的意義。我們都很清楚，這是個嚴謹的議題。柏格森曾提出，秩序之外有混亂，進步之外退步。這段話對世界的改變有著深遠的影響。探討php時，如果發現非常複雜，那麼想必不簡單。這種事實對本人來說意義重大，相信對這個世界也是有一定意義的。了解清楚php到底是一種怎麼樣的存在，是解決一切問題的關鍵。php究竟是怎麼樣的存在，始終是個謎題。蒙田曾經提過，發號施令愛情中是行不通的。這段話看似複雜，其中的邏輯思路卻清晰可見。php的存在，令我無法停止對他的思考。博克說過一句富有哲理的話，一個人只要肯深入到事物表面以下去探索，哪怕他自己也許看得不對，卻為旁人掃清了道路，甚至能使他的錯誤也終於為真理的事業服務。這是撼動人心的。俾斯麥說過一句著名的話，失敗是堅忍的最後考驗。想必各位已經看出了其中的端倪。歐陽修告訴我們，君子與君子以同道為朋，小人與小人以同利為朋 。這段話令我陷入了沈思。

            php對我來說，已經成為了我生活的一部分。'
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'title' => '台積電',
            'content' => '       經過上述討論，我們都有個共識，若問題很困難，那就勢必不好解決。現在，正視台積電的問題，是非常非常重要的。因為，不難發現，問題在於該用什麼標準來做決定呢？台積電改變了我的命運。總而言之，蘇格拉底相信，好習慣是一個人在社會交場中所能穿著的最佳服飾。這句話語雖然很短，但令我浮想聯翩。愛默生深信，藝術家一開始總是業餘愛好者。這句話讓我們得到了一個全新的觀點去思考這個問題。若到今天結束時我們都還無法釐清台積電的意義，那想必我們昨天也無法釐清。由於，李大釗說過一句著名的話，一切宗教沒有不受生產技術進步的左右的，沒有不隨著他變遷的。這段話令我陷入了沈思。德謨克里特曾經提過，連一個高尚朋友都沒有的人，是不值得活的。這段話令我陷入了沈思。我們不得不相信，探討台積電時，如果發現非常複雜，那麼想必不簡單。領悟其中的道理也不是那麼的困難。看看別人，再想想自己，會發現問題的核心其實就在你身旁。泰戈爾在過去曾經講過，蜜蜂從花中啜蜜離開時營營地道謝，浮誇的蝴蝶卻是相信花是應該向他道謝的。這段話可說是震撼了我。鄧小平講過一段耐人尋思的話，左已形成了一種習慣勢力，現在中國反對改革的人不多，但在製定和實行具體政策的時候，總容易出現有一點留戀過去的情況，習慣的東西就起作用，就冒出來了。這句話幾乎解讀出了問題的根本。說到台積電，你會想到什麼呢？如果別人做得到，那我也可以做到。拉巴丁曾經提過，為被人愛而愛人，是人; 為愛人而愛人，是神。希望大家能從這段話中有所收穫。我們可以很篤定的說，這需要花很多時間來嚴謹地論證。不要先入為主覺得台積電很複雜，實際上，台積電可能比你想的還要更複雜。我們要學會站在別人的角度思考。我們不妨可以這樣來想: 伊朗在過去曾經講過，疾馳的快馬，往往只跑兩個驛亭; 從容的驢子，才能日夜兼程。但願諸位理解後能從中有所成長。儘管台積電看似不顯眼，卻佔據了我的腦海。做好台積電這件事，可以說已經成為了全民運動。其實，若思緒夠清晰，那麼台積電也就不那麼複雜了。伏爾泰講過一句值得人反覆尋思的話，在理想的最美好世界中，一切都是為最美好的目的而設。這句話令我不禁感慨問題的迫切性。

            托克維爾講過一段耐人尋思的話，如果事先缺乏周密的準備，機遇也會毫無用處。這讓我對於看待這個問題的方法有了巨大的改變。台積電對我來說，已經成為了我生活的一部分。台積電可以說是有著成為常識的趨勢。米歇潘曾講過，生命是一條艱險的峽谷，只有勇敢的人才能通過。這句話決定了一切。巴爾扎克說過一句富有哲理的話，我們戀愛可能不感到快樂，也可能快樂而並非戀愛。強烈建議大家把這段話牢牢記住。'
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'title' => 'IG',
            'content' => '        本人也是經過了深思熟慮，在每個日日夜夜思考這個問題。如果仔細思考IG，會發現其中蘊含的深遠意義。紀伯倫曾經說過，一個人的意義不在於他的成就，而在於他所企求成就的東西。這影響了我的價值觀。若能夠洞悉IG各種層面的含義，勢必能讓思維再提高一個層級。對於一般人來說，IG究竟象徵著什麼呢？IG對我來說有著舉足輕重的地位，必須要嚴肅認真的看待。話雖如此，我們卻也不能夠這麼篤定。房玄齡曾經提到過，思危所以求安，慮退所以能進。這句話反映了問題的急切性。IG必定會成為未來世界的新標準。若無法徹底理解IG，恐怕會是人類的一大遺憾。

            世界需要改革，需要對IG有新的認知。問題的關鍵看似不明確，但想必在諸位心中已有了明確的答案。郭小川相信，但願每次回憶，對生活都不感到負疚。這句話看似簡單，但其中的陰鬱不禁讓人深思。培根講過，集體的習慣，其力量更大於個人的習慣。因此如果有一個有良好道德風氣的社會環境，是最有利於培訓好的社會公民的。這句話幾乎解讀出了問題的根本。康有為說過一句著名的話，虛驕自大者敗之媒，卑飛使用翼者擊之漸。這把視野帶到了全新的高度。我們普遍認為，若能理解透徹核心原理，對其就有了一定的了解程度。IG，發生了會如何，不發生又會如何。
    
            而這些並不是完全重要，更加重要的問題是，IG可以說是有著成為常識的趨勢。IG勢必能夠左右未來。這樣看來，那麼，這必定是個前衛大膽的想法。壯放講過一段耐人尋思的話，群眾是根莖，是海洋; 個人是樹葉。這段話令我陷入了沈思。俗話說的好，掌握思考過程，也就掌握了IG。莎士比亞在不經意間這樣說過，人的一生是短的，但如果卑劣地過這一生，就太長了。這段話對世界的改變有著深遠的影響。既然如此，邁茲納講過，不要把自己看得太重要，沒有你，事情一樣可以做得好。這不禁令我深思。德芳講過一段耐人尋思的話，毀於虛榮心的女性，比毀於愛情的還要多。想必各位已經看出了其中的端倪。我認為，我們一般認為，抓住了問題的關鍵，其他一切則會迎刃而解。我們都很清楚，這是個嚴謹的議題。做好IG這件事，可以說已經成為了全民運動。動機，可以說是最單純的力量。
    
            IG究竟是怎麼樣的存在，始終是個謎題。若到今天結束時我們都還無法釐清IG的意義，那想必我們昨天也無法釐清。我們都知道，只要有意義，那麼就必須慎重考慮。在人類的歷史中，我們總是盡了一切努力想搞懂IG。'
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'title' => '如果我有一座冰箱',
            'content' => '  如果我有一座冰箱似乎是一種巧合，但如果我們從一個更大的角度看待問題，這似乎是一種不可避免的事實。其實，若思緒夠清晰，那麼如果我有一座冰箱也就不那麼複雜了。

            做好如果我有一座冰箱這件事，可以說已經成為了全民運動。當前最急迫的事，想必就是釐清疑惑了。
    
            在人生的歷程中，如果我有一座冰箱的出現是必然的。富蘭克林說過一句著名的話，讀書是易事，思索是難事，但兩者缺一，便全無用處。這不禁令我深思。話雖如此，我想，把如果我有一座冰箱的意義想清楚，對各位來說並不是一件壞事。從這個角度來看，高爾基在過去曾經講過，勞動使人建立起對自己的理智力量的信心。這影響了我的價值觀。
    
            如果我有一座冰箱的發生，到底需要如何實現，不如果我有一座冰箱的發生，又會如何產生。把如果我有一座冰箱輕鬆帶過，顯然並不適合。赫拉克利特說過一句很有意思的話，與心作鬥爭是很難的，因為每一個願望都是以靈魂為代價換來的。這讓我對於看待這個問題的方法有了巨大的改變。'
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'title' => '彎腰郵筒',
            'content' => '     在這種不可避免的衝突下，我們必須解決這個問題。總而言之，了解清楚彎腰郵筒到底是一種怎麼樣的存在，是解決一切問題的關鍵。想必大家都能了解彎腰郵筒的重要性。若發現問題比我們想像的還要深奧，那肯定不簡單。若能夠洞悉彎腰郵筒各種層面的含義，勢必能讓思維再提高一個層級。我們要學會站在別人的角度思考。問題的核心究竟是什麼？所謂彎腰郵筒，關鍵是彎腰郵筒需要如何解讀。問題的關鍵究竟為何？我們需要淘汰舊有的觀念，那麼，而這些並不是完全重要，更加重要的問題是，塞萬提斯曾說過，真正的勇氣在極端的膽怯和魯莽之間。帶著這句話，我們還要更加慎重的審視這個問題。本人也是經過了深思熟慮，在每個日日夜夜思考這個問題。總結來說，奧維德講過一句值得人反覆尋思的話，從枝上摘下的蘋果比從雕花盤中取出的蘋果更有味。這影響了我的價值觀。儘管如此，別人往往卻不這麼想。魯迅曾講過，“一勞永逸”的話，有是有的，而“一勞永逸”的事卻極少。這段話令我陷入了沈思。說到彎腰郵筒，你會想到什麼呢？

            要想清楚，彎腰郵筒，到底是一種怎麼樣的存在。格羅夫講過一段耐人尋思的話，真正的科學不知道同情，也不知道厭惡，它的惟一目的就是真理。希望大家實際感受一下這段話。'
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'title' => 'ごじょう',
            'content' => '     若能夠欣賞到五條悟的美，相信我們一定會對五條悟改觀。我們不得不面對一個非常尷尬的事實，那就是，這種事實對本人來說意義重大，相信對這個世界也是有一定意義的。在人類的歷史中，我們總是盡了一切努力想搞懂五條悟。李四光曾經認為，科學尊重事實，不能胡亂編造理由來附會一部學說。但願諸位理解後能從中有所成長。儘管如此，別人往往卻不這麼想。總而言之，在這種困難的抉擇下，本人思來想去，寢食難安。拿破倉講過一段耐人尋思的話，佔據一個所不能勝任的職位，是最不道德的行為。這段話可說是震撼了我。若到今天結束時我們都還無法釐清五條悟的意義，那想必我們昨天也無法釐清。這必定是個前衛大膽的想法。

            既然如此，我想，把五條悟的意義想清楚，對各位來說並不是一件壞事。問題的關鍵究竟為何？司湯達講過一段深奧的話，做一個傑出的人，光有一個合乎邏輯的頭腦是不夠的，人還要有一種強烈的氣質。強烈建議大家把這段話牢牢記住。這樣看來，說到五條悟，你會想到什麼呢？我們要從本質思考，從根本解決問題。愛默生告訴我們，世上所能得到的最美麗的東西是漂。這是撼動人心的。當前最急迫的事，想必就是釐清疑惑了。現在，正視五條悟的問題，是非常非常重要的。因為，一般來說，德納姆深信，我們決不可被盲目所左右，每個人都有他自己的見地。這是撼動人心的。'
        ]);
        $essay->save();
    }
     
    /*
    public function run()
    {
        $essay = new \App\Essay([
            'imgPath' => 'src/assets/img/portfolio/01-thumbnail.jpg',
            'title' => 'Treads',
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'imgPath' => 'src/assets/img/portfolio/02-thumbnail.jpg',
            'title' => 'Explore',
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'imgPath' => 'src/assets/img/portfolio/03-thumbnail.jpg',
            'title' => 'Finish',
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'imgPath' => 'src/assets/img/portfolio/04-thumbnail.jpg',
            'title' => 'Lines',
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'imgPath' => 'src/assets/img/portfolio/05-thumbnail.jpg',
            'title' => 'Southwest',
        ]);
        $essay->save();

        $essay = new \App\Essay([
            'imgPath' => 'src/assets/img/portfolio/06-thumbnail.jpg',
            'title' => 'Window',
        ]);
        $essay->save();
    }
    */
}
